cf/InformationRegisters/IndividualsDescriptionFull.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>IndividualsDescriptionFull</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Surname</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Patronymic</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ind</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Individuals</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/IndividualsDescriptionFull/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ProgramInterface

// Function returns full name by specified individual
//
Function IndividualDescriptionFull(RelevanceDate, Ind) Export
	
	Query = New Query(
	"SELECT
	|	IndividualsDescriptionFullSliceLast.Surname,
	|	IndividualsDescriptionFullSliceLast.Name,
	|	IndividualsDescriptionFullSliceLast.Patronymic
	|FROM
	|	InformationRegister.IndividualsDescriptionFull.SliceLast(&RelevanceDate, Ind = &Ind) AS IndividualsDescriptionFullSliceLast");
	
	Query.SetParameter("RelevanceDate", RelevanceDate);
	Query.SetParameter("Ind", Ind);
	
	QueryResult	= Query.Execute();
	
	If QueryResult.IsEmpty() Then
		
		Return "";
		
	EndIf;
	
	Selection = QueryResult.Select();
	Selection.Next();
	
	Return SmallBusinessServer.GetSurnameNamePatronymic(Selection.Surname, Selection.Name, Selection.Patronymic, True);
	
EndFunction //IndividualFullName()

#EndRegion

#EndIf
